<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="de" xml:lang="de">
<head>
	<link rel="stylesheet" type="text/css" media="screen, projection" href="../style.css" />
	<title>Was bedeuten die vielen Buttons?</title>
	<script type="text/javascript" src="../docs.js"></script>
</head>
<body>
<h1>Was bedeuten die vielen Buttons?</h1>
<p>Viele der Buttons in diesem Editor kennen Sie sicher schon aus Ihrer Textverarbeitung (wie z.B. Microsoft<sup>&reg;</sup> Word<sup>&reg;</sup>), jedoch sind einige speziell für dieses System erstellt worden und m&uuml;ssen daher erl&auml;utert werden. Hier nun eine &Uuml;bersicht.</p>

<table>
	<tr>
		<td class="button_col"><span class="button new"></span></td>
		<td><strong>neues Dokument</strong><br />Mit dieser Schaltfläche können Sie ein neues Dokument beginnen.</td>
	</tr>
	<tr>
		<td><span class="button save"></span></td>
		<td><strong>Seite speichern</strong><br />Mit dieser Schaltfl&auml;che wird die aktuell bearbeitete Seite gespeichert. Nutzen Sie diese Schaltfläche h&auml;ufig!</td>
	</tr>
</table>
<p class="toc-link"><a href="{#toc_url}">{#toc}</a></p>

<table>
	<tr>
		<td><span class="button preview"></span></td>
		<td><strong>Vorschau</strong><br />Mit einem Klick auf diese Schaltfl&auml;che wird eine Vorschau der Seite mit allen Details der fertigen Seite erzeugt, damit Sie das Ergebnis pr&uuml;fen k&ouml;nnen, bevor sie speichern.</td>
	</tr>
</table>
<p class="toc-link"><a href="{#toc_url}">{#toc}</a></p>

<table>
	<tr>
		<td class="button_col"><span class="button cut"></span></td>
		<td><strong>Ausschneiden</strong><br />Das kennen Sie schon von Ihrer Textverarbeitung. Der markierte Bereich wird mit dieser Schaltfl&auml;che entfernt. Der Computer &quot;merkt&quot; sich dabei das gerade Entfernte und Sie k&ouml;nnen nun &uuml;ber die Einf&uuml;gefunktion den gerade ausgeschnittenen Bereich z.B. an anderer Stelle wieder einf&uuml;gen.</td>
	</tr>
	<tr>
		<td><span class="button copy"></span></td>
		<td><strong>Kopieren</strong><br />Das kennen Sie schon von Ihrer Textverarbeitung. Mit dieser Schaltfl&auml;che &quot;merkt&quot; sich der Computer den markierten Bereich, sodass Sie ihn an anderer Stelle wieder einf&uuml;gen k&ouml;nnen.</td>
	</tr>
	<tr>
		<td><span class="button paste"></span></td>
		<td><strong>Einf&uuml;gen</strong><br />Das kennen Sie schon von Ihrer Textverarbeitung. Mit dieser Schaltfl&auml;che k&ouml;nnen Sie das vom Computer &quot;Gemerkte&quot; wieder an der Position der Einf&uuml;gemarke (dem Cursor) einf&uuml;gen.</td>
	</tr>
</table>
<p class="toc-link"><a href="{#toc_url}">{#toc}</a></p>

<table>
	<tr>
		<td class="button_col"><span class="button search"></span></td>
		<td><strong>Suchen</strong><br />Die Suchfunktion kennen Sie schon von Ihrer Textverarbeitung.</td>
	</tr>
	<tr>
		<td><span class="button replace"></span></td>
		<td><strong>Ersetzen</strong><br />Das Ersetzen ist eine erweiterte Suchfunktion, denn hier k&ouml;nnen Sie festlegen, womit das Gefundene ersetzt werden soll. Lassen Sie das Feld f&uuml;r die Ersetzung leer, wird das Gefundene entfernt.</td>
	</tr>
</table>
<p class="toc-link"><a href="{#toc_url}">{#toc}</a></p>

<table>
	<tr>
		<td class="button_col"><span class="button undo"></span></td>
		<td><strong>R&uuml;ckg&auml;ngig machen</strong><br />Diese Schaltfl&auml;che ist auch als &quot;Panik-Knopf&quot; bekannt. Damit k&ouml;nnen Sie Aktionen wieder r&uuml;ckg&auml;ngig machen.</td>
	</tr>
		<td><span class="button redo"></span></td>
		<td><strong>Wieder herstellen</strong><br />Mit dieser Schaltfl&auml;che k&ouml;nnen Sie das R&uuml;ckg&auml;ngigmachen aufheben und den Zustand vor dem R&uuml;ckg&auml;ngigmachen wieder herstellen.</td>
	</tr>
</table>
<p class="toc-link"><a href="{#toc_url}">{#toc}</a></p>

<table>
	<tr>
		<td class="button_col"><span class="button removeformat"></span></td>
		<td><strong>Format entfernen</strong><br />Mit dieser Schaltfl&auml;che entfernen Sie im markierten Bereich Formatierungen wie Fett- oder Kursivschrift, hochgestellten und tiefgestellten Text, aber auch &uuml;ber CSS-Klassen definierte andere Layoutformatierungen.</td>
	</tr>
	<tr>
		<td><span class="button bold"></span></td>
		<td><strong>Fettschrift</strong><br />Das kennen Sie von Ihrer Textverarbeitung. Der markierte Bereich wird fett formatiert.</td>
	</tr>
	<tr>
		<td><span class="button italic"></span></td>
		<td><strong>Kursivschrift</strong><br />Das kennen Sie von Ihrer Textverarbeitung. Der markierte Bereich wird kursiv formatiert.</td>
	</tr>
</table>
<p class="toc-link"><a href="{#toc_url}">{#toc}</a></p>

<table>
	<tr>
		<td class="button_col"><span class="button bullist"></span></td>
		<td><strong>Liste</strong><br />Das kennen Sie schon von Ihrer Textverarbeitung. Mit dieser Schaltfl&auml;che wird der Text, in dem sich die Einf&uuml;gemarke (der Cursor) befindet, in einen Listenpunkt einer <em>nicht-nummerierten</em> Liste formatiert.</td>
	</tr>
	<tr>
		<td><span class="button numlist"></span></td>
		<td><strong>nummerierte Liste</strong><br />Das kennen Sie schon von Ihrer Textverarbeitung. Mit dieser Schaltfl&auml;che wird der Text, in dem sich die Einf&uuml;gemarke (der Cursor) befindet, in einen Listenpunkt einer <em>nummerierten</em> Liste formatiert. Weitere Listenpunkte werden entsprechend weiter nummeriert.</td>
	</tr>
</table>
<p class="toc-link"><a href="{#toc_url}">{#toc}</a></p>

<table>
	<tr>
		<td class="button_col"><span class="button link"></span></td>
		<td><strong>Link setzen/bearbeiten</strong><br />Markierte Textteile k&ouml;nnen mit dieser Schaltfl&auml;che zu einem anklickbaren Verweis gemacht werden. Auch bereits vorhandene Links lassen sich damit ver&auml;ndern. N&auml;heres zum Arbeiten mit Links finden Sie hier: [<a href="insert_links.htm">Links einf&uuml;gen</a>].</td>
	</tr>
	<tr>
		<td><span class="button unlink"></span></td>
		<td><strong>Link entfernen</strong><br />Mit dieser Schaltfl&auml;che wird ein Link wieder entfernt. Dazu k&ouml;nnen Sie einen Bereich markieren, innerhalb dessen alle Links entfernt werden sollen, oder aber nur die Einf&uuml;gemarke (den Cursor) auf einen Link setzen und diesen dann entfernen. Es besteht auch die M&ouml;glichkeit, ein verlinktes Wort nur zum Teil zu &quot;ent-linken&quot;, indem man den Teil markiert, der nicht mehr verlinkt sein soll.</td>
	</tr>
</table>
<p class="toc-link"><a href="{#toc_url}">{#toc}</a></p>

<table>
	<tr>
		<td class="button_col"><span class="button image"></span></td>
		<td><strong>Bild einf&uuml;gen/bearbeiten</strong><br />N&auml;heres zum Arbeiten mit Bildern finden Sie hier: [<a href="insert_images.htm">Bilder einf&uuml;gen</a>].</td>
	</tr>
</table>
<p class="toc-link"><a href="{#toc_url}">{#toc}</a></p>

<table>
	<tr>
		<td><span class="button charmap"></span></td>
		<td><strong>Sonderzeichen einf&uuml;gen</strong><br />&Uuml;ber diese Schaltfl&auml;che kann man aus einer Liste ein Sonderzeichen ausw&auml;hlen und auf der Seite einf&uuml;gen.</td>
	</tr>
	<tr>
		<td><span class="button hr"></span></td>
		<td><strong>Horizontalie Linie einf&uuml;gen</strong><br />Diese Schaltfl&auml;che erzeugt eine horizontalie Linie.</td>
	</tr>
	<tr>
		<td><span class="button sup"></span></td>
		<td><strong>Hochgestellt schreiben</strong><br />Mit dieser Schaltfl&auml;che wird der markierte Text <sup>hochgestellt</sup> formatiert.</td>
	</tr>
	<tr>
		<td><span class="button sub"></span></td>
		<td><strong>Tiefgestellt schreiben</strong><br />Mit dieser Schaltfl&auml;che wird der markierte Text <sub>tiefgestellt</sub> formatiert.</td>
	</tr>
	<tr>
		<td><span class="button visualaid"></span></td>
		<td><strong>Sichthilfen</strong><br />&Uuml;ber diese Schaltfl&auml;che kann man die Anzeige von Hilfslinien bei Tabellen an- oder ausschalten.</td>
	</tr>
	<tr>
		<td><span class="button code"></span></td>
		<td><strong>HTML-Code editieren</strong><br />Experten k&ouml;nnen &uuml;ber diese Schaltfl&auml;che den HTML-Code direkt bearbeiten. Der Editor ist allerdings angewiesen, nur bestimmte Elemente und Attribute zuzulassen.</td>
	</tr>
	<tr>
		<td><span class="button cleanup"></span></td>
		<td><strong>Anzeige auffrischen</strong><br />Diese Schaltfl&auml;che bewirkt, dass der Inhalt der Seite neu dargestellt wird. Dabei werden intern S&auml;uberungen am Code vorgenommen, um eventuelle beim Editieren aufgetretene Unstimmigkeiten zu bereinigen.</td>
	</tr>
</table>
<p class="toc-link"><a href="{#toc_url}">{#toc}</a></p>
</body>
</html>