<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="de" xml:lang="de">
<head>
	<link rel="stylesheet" type="text/css" media="screen, projection" href="../style.css" />
	<title>Wissenswertes</title>
	<script type="text/javascript" src="../docs.js"></script>
</head>
<body>
<h1>Wissenswertes</h1>

<h2>Unterschiede zu Textverarbeitungen (wie z.B. Microsoft<sup>&reg;</sup> Word<sup>&reg;</sup>)</h2>
<p>Eine Internetseite ist zun&auml;chst nicht unbedingt zum Ausdrucken auf Papier ausgelegt. Daher ist auch die Darstellung stark vom verwendeten Computer (Browser, Bildschirm, Betriebssystem) abh&auml;ngig, weshalb man beim Erstellen einer solchen Seite in der Regel nicht davon ausgehen kann, dass alles unbedingt immer und bei jedem Betrachter bis auf das i-T&uuml;pfelchen genau gleich aussieht. Das k&ouml;nnen Sie ganz leicht selbst ausprobieren, indem Sie in Ihrem Browser den Schriftgrad ver&auml;ndern, denn dann &quot;verrutscht&quot; der Text und ordnet sich den r&auml;umlichen Gegebenheiten entsprechend neu an.</p>
<p class="toc-link"><a href="{#toc_url}">{#toc}</a></p>

<p>Ein weiterer und wirklich wichtiger Unterschied ist, dass Bilder als externe (also eigenst&auml;ndige) Dateien auf derm Server vorliegen m&uuml;ssen, damit sie in eine Webseite eingebunden werden k&ouml;nnen. Textverarbeitungen speichern alle Komponenten eines Dokuments in einer einzigen Datei ab, die dann wie ein Container alle &quot;Zutaten&quot; enth&auml;lt, bei Webseiten ist das unm&ouml;glich. N&auml;here Einzelheiten zum Umgang mit Bildern finden Sie im <a href="insert_images.htm">Kapitel zum Einbinden von Bilddateien</a>.</p>
<p class="toc-link"><a href="{#toc_url}">{#toc}</a></p>

<h2 id="limitierte_gestaltung">Gestaltungsm&ouml;glichkeiten</h2>
<p>Die Gestaltungsm&ouml;glichkeiten auf einer Website sind oft reduziert worden. Dies dient einerseits dem einheitlichen &Auml;u&szlig;eren aller Seiten, andererseits f&ouml;rdert dieses Vorgehen eine bessere technische Strukturierung der Inhalte. Denken Sie nicht an die visuelle Darstellung, sondern denken Sie an Inhalte, die sinvoll strukturiert auf der Seite angeboten werden sollen!</p>

<p>Letzteres bedeutet, dass eine &Uuml;berschrift hier nicht nur wie eine &Uuml;berschrift aussieht, sondern auch technisch als eine solche realisiert ist. Unterschiede in den Schriftgr&ouml;&szlig;en der &Uuml;berschriften wirken nicht nur optisch wie eine hierarchische Untergliederung des Inhalts, es ist technisch eine echte Hierarchie umgesetzt! Der dem zugrunde liegende HTML-Code spiegelt demnach die inhaltliche Struktur wider - man spricht von semantischem Markup, welches als ein Ideal in der Webseitengestaltung angesehen wird, und welches von Suchmaschinen besonders effizient verarbeitet werden kann.</p>
<p class="toc-link"><a href="{#toc_url}">{#toc}</a></p>

<h2>Experten-Funktion: direktes Bearbeiten des Quellcodes</h2>
<p>&Uuml;ber die Schaltfl&auml;che <span class="button code"></span> k&ouml;nnen Sie den Quellcode direkt bearbeiten. Es werden jedoch einige HTML-Elemente vom Editor per Einstellungen unterdr&uuml;ckt, um einerseits volle XHTML-Kompatibilit&auml;t zu gew&auml;hrleisten, und um andererseits semantischen Code zu unterst&uuml;tzen. Daher kann es sein, dass das direkte Editieren manchmal zu unerwarteten Ergebnissen f&uuml;hrt.</p>
<p class="toc-link"><a href="{#toc_url}">{#toc}</a></p>
</body>
</html>