<p class="documentDescription">Sette inn interne-, eksterne- og anker-lenker.</p>

<h2>Interne Lenker</h2>

<p>Merk noe tekst eller et bilde, deretter trykker du p&aring;: Sett inn / rediger lenke-ikonet, og Sett inn / rediger lenke panelet vises:</p>

<br /> <img class="image-inline" src="img/insert_internal_link.jpg" />

<p> </p>

<p>Du bruker dette panelet ved &aring; klikke p&aring; Home eller Gjeldende mappe for &aring; begynne &aring; navigere p&aring; Plone nettsted for &aring; &aring; finne en mappe, side, eller et bilde som du &oslash;nsker &aring; lage en lenke til. I eksempelet ovenfor er en side som heter "Long-tailed Skippers" blitt valgt for koblingen.  Etter dette vinduet/panelet er lukket, vil en lenke til "Long-tailed Skippers" sidne vil bli laget.</p>

<p> </p>

<h2>Eksterne lenker</h2>

<p>Marker noe tekst eller et bilde, klikk p&aring; Sett inn / rediger lenke-ikonet, og velg Ekstern Lenke under Libraries, og Ekstern lenke panelet vises:</p>

<p> </p>

<p><img class="image-inline" src="img/insert_external_link.jpg" /></p>

<p> </p>

<p>Skriv inn nettadressen til en ekstern nettside i boksen etter http://. Du kan forh&aring;ndsvise lenken for &aring; sjekke at den er korrekt. Hvis du limer inn nettadressen, pass p&aring; at du ikke har dobbelt opp http:// i begynnelsen av adressen. Deretter klikker du ok. Den eksterne lenker vil bli satt p&aring; det markerte teksten eller bildet.</p>

<p> </p>

<h2>Anker</h2>

Anker er en slags posisjonsmark&oslash;r i et dokument, basert p&aring; overskrifter, underoverskrifter, eller en annen stil i dokumentet. Et eksempel: en side som heter "Eastern Tiger Swallowtail," har undertitler "Ingress", "Habitat", "Behavior", "Conservation Status", og "Litteratur", lenker til disse stedene i kan bli laget med ankere. <br />F&oslash;rst oppretter dokumentet med undertitler, deretter skriver du inn de samme titlene p&aring; toppen av dokumentet: <br /><br /><br />

<p align="left"><img class="image-inline" src="img/anchor_page.jpg" /></p>

<p align="left"> </p>

<p align="left">S&aring; oppretter du ankrene for hver underposisjon ved &aring;  flytte mark&oslash;ren undertittelen og trykk Sett inn / rediger anker. Skriv inn navnet p&aring; ankeret i Anchor navnefeltet. Deretter klikker du <i>ok.</i></p>

<p align="left"> </p>

<p align="left"><img class="image-inline" src="img/insert_anchor.jpg" /></p>

<p align="left"> </p>

<p align="left">Deretter velger du hver av mellomtitlene  p&aring; toppen av dokumentet og klikker p&aring; <br /> <i>Sett inn / rediger lenke</i> for &aring; velge av undertittel:</p>

<p align="left"> </p>

<p align="left"><img class="image-inline" src="img/insert_anchor_select_text.jpg" /></p>

<p align="left"> </p>

<p align="left">N&aring;r du velger Ankre under Libraries, vil en kunne velge hvilke undertitler som anker lenken lenker til:</p>

<p align="left"> </p>

<p align="left"><img class="image-inline" src="img/select_anchor.jpg" /></p>

<p align="left"> </p>

<p align="left">Lenke til ankeret kategorien vises. H&oslash;yre side av panelet viser ankere som har blitt satt i dokumentet. Her er Beskrivelse ankeret valgt for lenken (for ordet Beskrivelse, skrevet p&aring; toppen av dokumentet).</p>

<p align="left"> </p>

 
 